
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        7 |          18 |            5 |
## Affected resources by action

|  Action  | Resources                                                                                              |
|:--------:|:-------------------------------------------------------------------------------------------------------|
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-04b8845d896c6ebde"]`                 |
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-06caf71c8b0afd909"]`                 |
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0df885dcc99418799"]`                 |
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0f91dd2675e7a16c3"]`                 |
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-06caf71c8b0afd909"]`                  |
|    🟢    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-0f91dd2675e7a16c3"]`                  |
|    🟡    | `module.infrahouse_com.aws_route53_record.txt_spf`                                                     |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                                                 |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                                                       |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                                                   |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                                             |
|    🟡    | `module.vpn.aws_launch_template.openvpn`                                                               |
|    🟡    | `module.vpn.aws_vpc_security_group_ingress_rule.ssh`                                                   |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                                            |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs`                                       |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs`                                                 |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_service.ecs`                                                 |
|    🟡    | `module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs`                                         |
|    🟡    | `module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role`                                |
|    🟡    | `module.vpn.module.openvpn-portal.aws_security_group.backend_extra`                                    |
|    🟡    | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved`          |
|    🟡    | `module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user`              |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`                            |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`                              |
|    🔴    | `module.infrahouse_com.aws_route53_record.spf`                                                         |
|    🔴    | `module.jumphost.aws_vpc_security_group_ingress_rule.echo`                                             |
|    🔴    | `module.jumphost.aws_vpc_security_group_ingress_rule.efs`                                              |
|    🔴    | `module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrahouse_com.aws_route53_record.spf will be destroyed
  # (because aws_route53_record.spf is not in configuration)
  - resource "aws_route53_record" "spf" {
      - fqdn                             = "infrahouse.com" -> null
      - id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_SPF" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "infrahouse.com" -> null
      - records                          = [
          - "v=spf1 include:_spf.google.com ~all",
        ] -> null
      - ttl                              = 3600 -> null
      - type                             = "SPF" -> null
      - zone_id                          = "Z07662251LH3YRF2ERM3G" -> null
        # (2 unchanged attributes hidden)
    }

  # module.infrahouse_com.aws_route53_record.txt_spf will be updated in-place
  ~ resource "aws_route53_record" "txt_spf" {
        id                               = "Z07662251LH3YRF2ERM3G_infrahouse.com_TXT"
        name                             = "infrahouse.com"
      ~ records                          = [
          - "v=spf1 include:_spf.google.com ~all",
          + "v=spf1 include:_spf.google.com -all",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_vpc_security_group_ingress_rule" "echo" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0983003415637d541" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "Allow NLB healthchecks" -> null
      - from_port              = 7 -> null
      - id                     = "sgr-0983003415637d541" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0bc8f2feda3620f6f" -> null
      - security_group_rule_id = "sgr-0983003415637d541" -> null
      - tags                   = {
          - "Name"              = "Echo access"
          - "created_by_module" = "infrahouse/jumphost/aws"
        } -> null
      - tags_all               = {
          - "Name"              = "Echo access"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/jumphost/aws"
          - "environment"       = "production"
        } -> null
      - to_port                = 7 -> null
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-04b8845d896c6ebde"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "echo" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.2.0/24"
      + description            = "Allow NLB health checks from ASG subnets"
      + from_port              = 7
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0bc8f2feda3620f6f"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "Echo access from subnet-04b8845d896c6ebde"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "Echo access from subnet-04b8845d896c6ebde"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 7
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-06caf71c8b0afd909"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "echo" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.3.0/24"
      + description            = "Allow NLB health checks from ASG subnets"
      + from_port              = 7
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0bc8f2feda3620f6f"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "Echo access from subnet-06caf71c8b0afd909"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "Echo access from subnet-06caf71c8b0afd909"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 7
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0df885dcc99418799"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "echo" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/24"
      + description            = "Allow NLB health checks from ASG subnets"
      + from_port              = 7
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0bc8f2feda3620f6f"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "Echo access from subnet-0df885dcc99418799"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "Echo access from subnet-0df885dcc99418799"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 7
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.echo["subnet-0f91dd2675e7a16c3"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "echo" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.1.0/24"
      + description            = "Allow NLB health checks from ASG subnets"
      + from_port              = 7
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0bc8f2feda3620f6f"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "Echo access from subnet-0f91dd2675e7a16c3"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "Echo access from subnet-0f91dd2675e7a16c3"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 7
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_vpc_security_group_ingress_rule" "efs" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-011e2fea66d74b99f" -> null
      - cidr_ipv4              = "10.0.0.0/22" -> null
      - description            = "Allow NFS traffic to EFS volume" -> null
      - from_port              = 2049 -> null
      - id                     = "sgr-011e2fea66d74b99f" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-02906b36c9d1be156" -> null
      - security_group_rule_id = "sgr-011e2fea66d74b99f" -> null
      - tags                   = {
          - "Name"              = "NFS traffic"
          - "created_by_module" = "infrahouse/jumphost/aws"
        } -> null
      - tags_all               = {
          - "Name"              = "NFS traffic"
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/jumphost/aws"
          - "environment"       = "production"
        } -> null
      - to_port                = 2049 -> null
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-06caf71c8b0afd909"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.3.0/24"
      + description            = "Allow NFS traffic to EFS volume"
      + from_port              = 2049
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-02906b36c9d1be156"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "NFS traffic"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "NFS traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 2049
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.efs["subnet-0f91dd2675e7a16c3"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.1.0/24"
      + description            = "Allow NFS traffic to EFS volume"
      + from_port              = 2049
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-02906b36c9d1be156"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "NFS traffic"
          + "created_by_module" = "infrahouse/jumphost/aws"
        }
      + tags_all               = {
          + "Name"              = "NFS traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/jumphost/aws"
          + "environment"       = "production"
        }
      + to_port                = 2049
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0e5d85805b1236e19"
            name    = "postfix-20240326221552532900000008"
          ~ version = "11" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-0e9db8a56316dabe0" -> "ami-0cf0c9fe4bfb45d2b"
      ~ latest_version                       = 11 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0f7a032c61f3f5094"
            name    = "openvpn-2024070518392010580000001e"
          ~ version = "4" -> (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-0e9db8a56316dabe0" -> "ami-0cf0c9fe4bfb45d2b"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
        tags                                 = {
            "created_by_module" = "infrahouse/openvpn/aws"
            "service"           = "openvpn"
        }
        # (16 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + volume_size           = 30
            }
        }

        # (1 unchanged block hidden)
    }

  # module.vpn.aws_vpc_security_group_ingress_rule.ssh will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "ssh" {
      ~ cidr_ipv4              = "0.0.0.0/0" -> "10.0.0.0/22"
        id                     = "sgr-0ed7be34a1f7f8d30"
        tags                   = {
            "Name"              = "SSH access"
            "created_by_module" = "infrahouse/openvpn/aws"
            "service"           = "openvpn"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_appautoscaling_policy.ecs_policy must be replaced
-/+ resource "aws_appautoscaling_policy" "ecs_policy" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/openvpn-portal/openvpn-portal-AlarmHigh-d483e93b-e958-4645-a758-c5114c9e0aa5",
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/openvpn-portal/openvpn-portal-AlarmLow-69712e51-95e6-469d-a6bc-8c6bc7898b80",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:eae89640-67b6-453f-9153-efca560a4984:resource/ecs/service/openvpn-portal/openvpn-portal:policyName/cpu-auto-scaling" -> (known after apply)
      ~ id                 = "cpu-auto-scaling" -> (known after apply)
      ~ name               = "cpu-auto-scaling" -> "auto-scaling" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/openvpn-portal"
        name     = "openvpn-portal"
      ~ tags     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/openvpn-portal/openvpn-portal"
        name                               = "openvpn-portal"
      ~ tags                               = {
          ~ "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOiJzZ3ItMDY1NWZlYzVjMTU5MTA4MTkiLCJiYWNrZW5kX3NzaF9sb2Nh" -> "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiZjBiYzM5MGY3"
            "created_by_module"               = "infrahouse/ecs/aws"
            "execution_role_arn"              = "arn:aws:iam::493370826424:role/openvpn-portalTaskExecutionRole20240705183912611900000005"
            "instance_role_policy_attachment" = "openvpn-portal-instance-j8szhwpnnnfu20240705183912601000000001-20240705183914452000000010"
            "instance_role_policy_name"       = "openvpn-portal-instance-j8szhwpnnnfu2024070518391381960000000c"
            "load_balancer_arn"               = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/openvp2024070518391751950000001c/539fb530eebce408"
          ~ "module_version"                  = "3.2.0" -> "3.5.0"
            "target_group_arn"                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2024070518391297700000000a/a48a76cdd3cd12a8"
        }
      ~ tags_all                           = {
          ~ "backend_security_group"          = "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOiJzZ3ItMDY1NWZlYzVjMTU5MTA4MTkiLCJiYWNrZW5kX3NzaF9sb2Nh" -> "eyJiYWNrZW5kIjp7ImlkIjoic2ctMGI2MjQ0YjkwOGIzMGE2NmQiLCJydWxlcyI6eyJiYWNrZW5kX2ljbXAiOiJzZ3ItMDg4NGZjYmYxNmViNzA4YTgiLCJiYWNrZW5kX291dGdvaW5nIjoic2dyLTAyOWE2MGFiM2ZmZWI5YjNlIiwiYmFja2VuZF9zc2hfaW5wdXQiOm51bGwsImJhY2tlbmRfc3NoX2xvY2FsIjoic2dyLTBiZjBiYzM5MGY3"
          ~ "module_version"                  = "3.2.0" -> "3.5.0"
            # (8 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.aws_ecs_task_definition.ecs will be updated in-place
  ~ resource "aws_ecs_task_definition" "ecs" {
        id                       = "openvpn-portal"
      ~ tags                     = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all                 = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpn.module.openvpn-portal.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "openvpn-portalTaskExecutionRole20240705183912611900000005"
        name                  = "openvpn-portalTaskExecutionRole20240705183912611900000005"
      ~ tags                  = {
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all              = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_security_group.backend_extra will be updated in-place
  ~ resource "aws_security_group" "backend_extra" {
        id                     = "sg-0b6595dd62b412fc4"
        name                   = "openvpn-portal-2024070518391440710000000e"
      ~ tags                   = {
            "Name"              = "ECS openvpn-portal backend"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
        id                     = "sgr-04121d07477ccac76"
      ~ tags                   = {
            "Name"              = "ECS reserved"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.aws_vpc_security_group_ingress_rule.backend_extra_user will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
        id                     = "sgr-0ece0a93c49897a2b"
      ~ tags                   = {
            "Name"              = "ECS user traffic"
            "created_by_module" = "infrahouse/ecs/aws"
          ~ "module_version"    = "3.2.0" -> "3.5.0"
        }
      ~ tags_all               = {
          ~ "module_version"    = "3.2.0" -> "3.5.0"
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0ef83181fbf251354"
            name    = "openvp20240705183917137600000019"
          ~ version = "4" -> (known after apply)
        }

      - tag {
          - key                 = "parent_module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.2.0" -> null
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.5.0"
        }

        # (10 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-03a7d66ef73d36f8a" -> "ami-06886ac35c1b2ce5b"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.vpn.module.openvpn-portal.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input)
  - resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0655fec5c15910819" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "SSH access from the service specified CIDR range" -> null
      - from_port              = 22 -> null
      - id                     = "sgr-0655fec5c15910819" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0b6244b908b30a66d" -> null
      - security_group_rule_id = "sgr-0655fec5c15910819" -> null
      - tags                   = {
          - "Name" = "SSH additional"
        } -> null
      - tags_all               = {
          - "Name"        = "SSH additional"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 22 -> null
    }

Plan: 7 to add, 18 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDcsICJjaGFuZ2UiOiAxOCwgImRlc3Ryb3kiOiA1fX0=
```
</details>